# SQL 4 Data Science: Predict Project
## Bhejane Online Trading Store

### Student Starter Notebook

Â© Explore Data Science Academy

### Honour Code

I {RIZQAH, MENIERS}, confirm - by submitting this document - that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

<a id='Context'></a>
### 1. Context

The Bhejane trading store is an online retailer specialising in Covid essential items. The store has recently been struggling with the management of its database-related inventory system. Luckily for them, you've been hired as a consultant to fix the problem. 

Its time to flex your Ninja SQL skills! 
 
**Your mission, should you choose to accept it:**

You will receive a denormalised database consisting of two tables. Your task is to transform the database such that is in third normal form (3NF). To ensure that a consistent normalisation process is followed by each student, we have attached an Entity Relationship Diagram (ERD) which is a guideline on what tables need to be produced. Once you have normalised the database, you will be required to complete an MCQ test found under the 'Predict' tab of Athena.  

Though the normalisation process, you will be guided into acknowledging client (Bhenjane Trading) use-cases for the database, and dealing with data anomalies in SQL.

![Bhejane company logo](https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/Bhejane.png)

<div align="center" >
    Bhejane, or the Black Rhino. Image by <a href="https://commons.wikimedia.org/wiki/File:Black_Rhino_(Diceros_bicornis)_browsing_..._(46584052962).jpg">Wikimedia Commons</a>
</div>

<a id='Imports'></a>
### 2. Imports
Please use the below command to install sql_magic, this is the package that will assist you with SQL syntax hightlighting.
* pip install sql_magic

Remember to start each new cell with " %%read_sql "

In [119]:
# DO NOT EDIT THIS CELL
import sqlite3
import csv
from sqlalchemy import create_engine
%load_ext sql_magic

# Load SQLite database
engine  = create_engine("sqlite:///bhejane.db")
%config SQL.conn_name ='engine'

The sql_magic extension is already loaded. To reload it, use:
  %reload_ext sql_magic

<a id='Data_description'></a>
### 3. Data description

The original database consist of 2 tables. 
* Product Table
* Transaction Table

The `Product` table consists of the stock of all inventory that Bhejane has on hand currently, or has had on hand historically. Items which are in this table are able to be purchased, and a record of all sales (transactions) in 2020 is notorised in the `Transactions` table. To link the tables - the `barcode` can be used. Any item in the `Transactions` table, must therefore appear in the `Products` table.

In [120]:
# DO NOT EDIT THIS CELL
import pandas as pd
data_description = pd.read_excel('Data Description.xlsx')
data_description

,Table Name,Column Name,Desciption
0,Products,Width,Width of the product once assembled
1,Products,Length,Length of the product once assembled
2,Products,Height,Height of the product once assembled
3,Products,Barcode,The unique product identifier
4,Products,Quantity,Number of goods in stock
5,Products,Brand,Product brand name relating to product company
6,Products,NavigationPath,Navigation path to specific product
7,Products,Colour,Name default colour for the product
8,Products,StockCountry,Country where the stock was bought from
9,Products,ProductDescription,Descriptive product name
10,Products,PackType,The way in which the product is packaged
11,Products,Volume_litre,The quantity of liquid based products
12,Products,Warranty,Product warranty type
13,Products,Weight_kg,Weight of the product
14,Products,ItemDescription,Description of contents of the package
15,Products,Price,The cost of the product in Rands
16,Transactions,CartID,Identifies an individual basket from a user pu...
17,Transactions,Barcode,Barcode for item that user purchased
18,Transactions,Total,Total value of a transaction
19,Transactions,UserName,Name of customer purchasing stock
20,Transactions,InvoiceDate,Date on which the product was bought

<a id='Setting_up'></a>
### 4. Setting up the database

In [121]:
#DO NOT EDIT THIS CELL
conn = sqlite3.connect('bhejane.db')
cursor = conn.cursor()

#### Creating both Products and Transaction Tables

In [122]:
%%read_sql
--DO NOT EDIT THIS CELL
DROP TABLE IF EXISTS "Products";
DROP TABLE IF EXISTS "Transactions";

CREATE TABLE "Products" (
    "Width"   REAL,
    "Length"  REAL,
    "Height"  REAL,
    "Barcode" VARCHAR(150),
    "Quantity" REAL,
    "Brand" VARCHAR(150), 
    "NavigationPath" VARCHAR(150),
    "Colour" VARCHAR(150),
    "StockCountry" VARCHAR(150),
    "ProductDescription" VARCHAR(150),
    "PackType" VARCHAR(150), 
    "Volume_litre" REAL, 
    "Warranty" VARCHAR(150), 
    "Weight_kg" REAL,
    "ItemDescription" VARCHAR(150), 
    "Price" REAL
);


CREATE TABLE "Transactions" (
    "CartID" INTEGER,
    "Barcode" VARCHAR(150), 
    "Total" REAL,
    "UserName" VARCHAR(150), 
    "InvoiceDate" DATETIME
);

Query started at 07:25:53 PM South Africa Standard Time; Query executed in 0.00 m

#### Load Data into Product and Transaction tables

Although we have not yet covered python in the sprint at EXPLORE - you have additional resources at your disposal, one of which happens to be a data engineering expert, and she has created a brief script for you which can be used to extract the data from the csv files, and load it into a sqlite database. 

This will be included in your submission, so that the end-to-end processing of the data is visible, and repeatable for any additional consultants who may be brought on board at a later stage.

In [123]:
# DO NOT EDIT CELL
#Load data into Product table
with open('bhejane_covid_essentials_Products.csv','r') as fin: # `with` statement available in 2.5+
    # csv.DictReader uses first line in file for column headings by default
    dr = csv.DictReader(fin) # comma is default delimiter
    to_db = [(i['Width'],i['Length'],i['Height'], i['Barcode'], i['Quantity'], i['Brand'], i['NavigationPath'], i['Colour'], i['StockCountry'], i['ProductDescription'],i['PackType'],i['Volume_litre'],i['Warranty'],i['Weight_kg'],i["ItemDescription"],i['Price']) for i in dr]

cursor.executemany("INSERT INTO Products VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?);", to_db)
conn.commit()

with open('bhejane_covid_essentials_Transactions.csv','r') as fin: # `with` statement available in 2.5+
    # csv.DictReader uses first line in file for column headings by default
    dr = csv.DictReader(fin) # comma is default delimiter
    to_db = [(i['CartID'],i['Barcode'], i['Total'], i['UserName'], i['InvoiceDate']) for i in dr]

cursor.executemany("INSERT INTO Transactions VALUES (?, ?, ?, ?, ?);", to_db)
conn.commit()

<a id='ERD'></a>
### 5. Denormalized Database Tables

<br>

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/Denormalized_Tables.png" alt="Denormalized Tables" border="0">

#### 5.1 Explore the Denormalized Tables
Familiarize yourself with the data given in the two tables by writing your own SQL queries to explore properties of the dataset.i.e Look for data inconsistencies, anormalies, redundancies etc to guide your normalization process. 

This section will not be graded - think of it as your own scratch pad.

In [124]:
%%read_sql
-- #Use this section to explore the database by writing your own queries
SELECT * FROM Transactions
LIMIT 10;

Query started at 07:25:53 PM South Africa Standard Time; Query executed in 0.00 m

   CartID       Barcode   Total  UserName         InvoiceDate
0     102     300507946  1523.0    DIMPHO  2020-07-02 0:00:00
1       1   43859499182   149.0   Hendrik  2020-08-05 0:00:00
2       2  614143543746    99.0  Faristha  2020-07-29 0:00:00
3     179  617566827837  3464.0    Zanele  2020-04-04 0:00:00
4     136  619659097318  3301.0    Junaid  2020-08-04 0:00:00
5       3  619659141059    75.0     JOHAN  2020-05-20 0:00:00
6     111  619659141080   550.0   Michael  2020-04-18 0:00:00
7     112  619659161354   357.0      Nico  2020-05-09 0:00:00
8       4  638142992763    44.0    Sandra  2020-03-25 0:00:00
9       5  638142992763    44.0    Sheila  2020-08-03 0:00:00

### 6. Normalize the given Database tables to the 1st Normal Form (1NF)

Given the below below target ERD create new tables such the the database conforms to the 1st Normal Form

![1st Normal Form](https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/1stNF.png)


It is suggested that you create all your tables before attempting to populate them with data, this will help reduce errors that might creep up due to logical dependencies.

#### 6.1 Create the tables required for the 1st Normal Form
Use the above ERD sketch to create the required tables. Please label your tables as they appear in the ERD sketch

In [125]:
%%read_sql
--#Create tables required for 1NF
DROP TABLE IF EXISTS "Products_1NF";
DROP TABLE IF EXISTS "Transactions_1NF";

CREATE TABLE "Products_1NF"(
    "Barcode" VARCHAR(150),
    "NavigationPath" VARCHAR(150),
    "ItemDescription" VARCHAR(150),
    "Colour" VARCHAR(150),
    "ProductDescription" VARCHAR(150) NOT NULL,
    "Brand" VARCHAR(150),
    "Price" REAL NOT NULL,
    "Quantity" INTEGER NOT NULL,
    "PackType" VARCHAR(150),
    "Warranty" VARCHAR(150),
    "StockCountry" VARCHAR(150),
    "Weight_kg" REAL,
    "Volume_litre" REAL,
    "Length" REAL,
    "Width" REAL,
    "Height" REAL,
    PRIMARY KEY("Barcode","NavigationPath","ItemDescription")
);

CREATE TABLE "Transactions_1NF" (
    "CartID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "UserName" VARCHAR(150) NOT NULL,
    "InvoiceDate" DATETIME NOT NULL,
    "Total" REAL NOT NULL,
    FOREIGN KEY ("Barcode") REFERENCES "Products_1NF" ("Barcode"),
    PRIMARY KEY("CartID", "Barcode", "UserName")
);

Query started at 07:25:53 PM South Africa Standard Time; Query executed in 0.00 m

#### 6.2 Populate the tables you have create in the above section.

Populate the tables such that the database conforms to the 1st Normal Form

In [126]:
%%read_sql
--#Populate the 1NF tables
DELETE FROM "Products_1NF";
DELETE FROM "Transactions_1NF";

INSERT INTO "Products_1NF" ("Barcode","NavigationPath","ItemDescription","Colour","ProductDescription","Brand",
                            "Price","Quantity","PackType","Warranty","StockCountry","Weight_kg",
                            "Volume_litre","Length","Width","Height")
SELECT DISTINCT
     Barcode
    ,NavigationPath
    ,ItemDescription
    ,Colour
    ,ProductDescription
    ,Brand
    ,Price
    ,Quantity
    ,PackType
    ,Warranty
    ,StockCountry
    ,Weight_kg
    ,Volume_litre
    ,Length
    ,Width
    ,Height 
FROM 
    Products;

INSERT INTO "Transactions_1NF"("CartID","Barcode","UserName","InvoiceDate","Total")
SELECT DISTINCT 
    CartID
    ,Barcode
    ,UserName
    ,InvoiceDate
    ,Total
FROM
    Transactions;

Query started at 07:25:53 PM South Africa Standard Time; Query executed in 0.00 m

###  7. Convert the database into its 2nd Normal Form (2NF).

Please label your tables as they appear in the ERD sketch.

#### 7.1 Entity Relationship Diagram

![2nd Normal Form](https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/2ndNF.png)

#### 7.2 2NF Requirements
To transition from 1NF to 2NF, we need all columns in all tables to not have a partial dependancy on the PK of the table. This means that any tables which have a composite key e.g. `PRIMARY KEY("Barcode","NavigationPath","ItemDescription")` cannot have columns in the table which are dependant on only `Barcode`, `NavigationPath`, or `ItemDescription`. 

In moving to 2NF we will seperate out each of these as a primary key (for their own respective tables), and any columns dependant on one of these columns but not the others, will go into that table. The only columns remaining in the tables will be fully functionally dependant on the primary key of the table. For example, 

Thereby, we remove the partial dependancy, and will be in 2NF. We are instructed to create a unique identifier for the `Transactions_2NF`. 

**Second normal form notes**

<br>$\bullet$ Notice that `Total` is only dependant on `CartID` and not on `<CartID,barcode>`. This is a partial dependancy
<br>$\bullet$ Second normal form required no *partial functional dependancy* on the key. 
<br>$\bullet$ This can be achieved in 2 ways: create a unique identifier per row (so that there is a simple primary key), or break the table up into only the columns which are fully dependant on the composite key. 
<br>$\bullet$ We are going to opt for the easier solution, and create a unique simple primary key on the `Transactions_1NF`. We can create a unique primary key by concatenating `CartID||barcode`
<br>$\bullet$ NB - this approach does make it more challenging to get into 3NF! Which would be a good argument to opt for the latter approach.

#### 7.3 Data Anomalies

You may stumble into an error when you insert the data which violates this constraint. You query this with the data owner, and you are told that there are three transactions in the database which were errors. You are informed that *all transactions in the database correspond to products are in the database*.

These entries were captured incorrectly, and must be removed. How will you deal with this?

In [127]:
%%read_sql
select count(distinct barcode) from Transactions_1NF where barcode not in (select barcode from products_1NF)

Query started at 07:25:53 PM South Africa Standard Time; Query executed in 0.00 m

   count(distinct barcode)
0                        2

### <font color='turquoise'>Action: remove the affected entries with a `delete` query </font>

In [128]:
%%read_sql
delete from Transactions_1NF
where barcode not in (select barcode from products_1NF);

Query started at 07:25:53 PM South Africa Standard Time; Query executed in 0.00 m

In [129]:
%%read_sql
-- Should show no entries!
select count(distinct barcode) from Transactions_1NF where barcode not in (select barcode from products_1NF)

Query started at 07:25:53 PM South Africa Standard Time; Query executed in 0.00 m

   count(distinct barcode)
0                        0

#### 7.4 FK Requirements

_Note: sqlite does not always enforce foreign key constraints (and it is even more inconsistent with magic commands to enforce FK constraints!), so it is critical that you understand the purpose of the foreign key constraint and therefore are able to enforce the FK constraint yourself!_

To enforce data integrity, and to ensure that strange things cannot happen - we will have a FK constraint. A foreign key forces all values of the FK, to be limited to only the values which exist as entries in the PK column of the table for which the aforementioned table is a foreign key to. For example, we cannot sell a product (in our Transactions table) which we do not have in our Products table. 

You will need to work around this by removing the erroneous data from the tables before continuing, since this would violate the FK constraint between the Transactions_2NF and Products_2NF table otherwise. 

_Hint: Identify the observations in the Transactions_1NF table, and remove them from there._

#### 7.5 Client Use-Case Requirements

The data owner has advised that there were several instances of incorrect data capturing. Whenever data was partially captured, it was redone, but the partially-complete entries have not been removed from the database. 

For all tables which are going to be used, consider the table utility relative to the Products (Products_2NF) table. You are tasked with removing 'useless' entries as you take the data from 1NF to 2NF. For the sake of ease-of-use for the client, we will removing all rows in the 2NF tables `PackageContents_2NF` and `Colours_2NF` which have an empty value for the attributes that the client will use them for - these are the `ItemDescription` and `Colour` columns, respectively. 

_Hint: Make inserts into the other 2NF (`PackageContents_2NF` and `Colours_2NF`) tables using a `where` clause to remove instances of the value being an empty string, or a `null` value. This will need to be considered for the `ItemDescription` and for the `Colour` when data is inserted into the corresponding tables above (i.e. only insert data into the `PackageContents_2NF` which has a value for the `ItemDescription`, and only insert data into the `Colours_2NF` table which has a value for `Colour`_

### <font color='turquoise'>Action: Investigate these anomalies for the tables mentioned </font>

In [130]:
%%read_sql 

SELECT DISTINCT 
    ItemDescription,
    PackType,
    Warranty 
FROM
    Products
WHERE ItemDescription = '';

Query started at 07:25:54 PM South Africa Standard Time; Query executed in 0.00 m

   ItemDescription PackType              Warranty
0                              Limited (6 months)
1                                  Non-Returnable
2                             Limited (12 months)
3                            Limited (120 months)
4                            Limited (180 months)
5                             Limited (18 months)
6                            Supplier (12 months)
7                    Single    Limited (6 months)
8                             Limited (24 months)
9
10                            Limited (36 months)
11                                Full (6 months)

### Let's do it! Construct the database above in second normal form

In [131]:
%%read_sql
--#Create tables required for 2NF

DROP TABLE IF EXISTS "Products_2NF";
DROP TABLE IF EXISTS "Transactions_2NF";
DROP TABLE IF EXISTS "Navigation_2NF";
DROP TABLE IF EXISTS "PackageContents_2NF";
DROP TABLE IF EXISTS "Colours_2NF";

CREATE TABLE Products_2NF(
    "RegistryID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "ProductDescription" VARCHAR(150) NOT NULL,
    "Brand" VARCHAR(150),
    "Price" REAL NOT NULL,
    "Quantity" INTEGER NOT NULL,
    "StockCountry" VARCHAR(150),
    "Weight_kg" REAL,
    "Volume_litre" REAL,
    "Length" REAL,
    "Width" REAL,
    "Height" REAL,
    "PathID" INTEGER,
    "ItemID" INTEGER,
    "ColourID" INTEGER,
    PRIMARY KEY(RegistryID AUTOINCREMENT),
    CONSTRAINT fk_nav FOREIGN KEY('PathID') REFERENCES Navigation_2NF ('PathID'),
    CONSTRAINT fk_pack FOREIGN KEY('ItemID') REFERENCES PackageContents_2NF ('ItemID'),
    CONSTRAINT fk_col FOREIGN KEY('ColourID') REFERENCES Colours_2NF ('ColourID') 
);

CREATE TABLE "Transactions_2NF" (
    "CartID||Barcode||UserName" VARCHAR(150) NOT NULL,
    "CartID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "UserName" VARCHAR(150) NOT NULL,
    "InvoiceDate" DATETIME NOT NULL,
    "Total" REAL NOT NULL,
    PRIMARY KEY("CartID||Barcode||UserName")
    CONSTRAINT fk_trans FOREIGN KEY('Barcode') REFERENCES Products_2NF ('Barcode')
);


CREATE TABLE "Navigation_2NF"(
    "PathID" INTEGER NOT NULL,
    "NavigationPath" VARCHAR(150),
    PRIMARY KEY("PathID" AUTOINCREMENT)
);

CREATE TABLE "Colours_2NF"(
    "ColourID" INTEGER NOT NULL,
    "Colour" VARCHAR(150),
    PRIMARY KEY("ColourID" AUTOINCREMENT)
);

CREATE TABLE "PackageContents_2NF"(
    "ItemID" INTEGER NOT NULL,
    "ItemDescription" VARCHAR(150),
    "PackType" VARCHAR(150),
    "Warranty" VARCHAR(150),
    PRIMARY KEY("ItemID" AUTOINCREMENT)
);

Query started at 07:25:54 PM South Africa Standard Time; Query executed in 0.00 m

### Let's do it! _Populate_ the database above in second normal form

Firstly, let's consider the entries which are `null` and `= ''`. And we will only insert the relevant entries.

In [132]:
%%read_sql
-- #Populate the tables so that they conform to 2NF

DELETE FROM "Products_2NF";
DELETE FROM "Transactions_2NF";
DELETE FROM "Navigation_2NF";
DELETE FROM "PackageContents_2NF";
DELETE FROM "Colours_2NF";


INSERT INTO "Navigation_2NF"("NavigationPath")
SELECT DISTINCT 
    NavigationPath 
FROM
    Products_1NF;
    
INSERT INTO "PackageContents_2NF"("ItemDescription","PackType","Warranty")
SELECT DISTINCT 
    ItemDescription,
    PackType,
    Warranty 
FROM
    Products_1NF
WHERE ItemDescription <> ''
        ;
    
INSERT INTO "Colours_2NF"("Colour")
SELECT DISTINCT 
    Colour
FROM
    Products_1NF
WHERE Colour <> ''
        ;

Query started at 07:25:54 PM South Africa Standard Time; Query executed in 0.00 m

A more complicated scenario below as we insert into `Products_2NF`. We will insert from the Products_1NF table. We can use LEFT JOIN, because the data in each of these tables that `Products_1NF` has a FK to, originally came from `Products_1NF`, so we are gauranteed to get matches back. Normally however, what you would get from the FK restriction is the requirement to use _parent-table_ `LEFT JOIN` _child-table_.

In [133]:
%%read_sql 

INSERT INTO "Products_2NF" ("PathID","ItemID","ColourID","Barcode","ProductDescription","Brand","Price",
                            "Quantity","StockCountry","Weight_kg","Volume_litre",
                            "Length","Width","Height")
SELECT
    PathID,
    ItemID,
    ColourID,
    Products_1NF.Barcode,
    ProductDescription,
    Brand,
    Price,
    Quantity,
    StockCountry,
    Weight_kg, 
    Volume_litre, 
    Length,
    Width,
    Height 
FROM 
    Products_1NF
LEFT JOIN Navigation_2NF ON Products_1NF.NavigationPath = Navigation_2NF.NavigationPath 
LEFT JOIN PackageContents_2NF ON Products_1NF.ItemDescription = PackageContents_2NF.ItemDescription
LEFT JOIN Colours_2NF ON Products_1NF.Colour = Colours_2NF.Colour

Query started at 07:25:54 PM South Africa Standard Time; Query executed in 0.00 m

Last but not least, we insert into the `Transactions_2NF`table. Recall that we created a new PK in this table, and pay attention to how we are inserting values into the table.

In [134]:
%%read_sql 

INSERT INTO "Transactions_2NF"("CartID||Barcode||UserName","CartID","Barcode","UserName","InvoiceDate","Total")
SELECT DISTINCT 
    CartID||Transactions_1NF.Barcode||UserName,
    CartID,
    Transactions_1NF.Barcode,
    UserName,
    InvoiceDate,
    Total
FROM
    Transactions_1NF
LEFT JOIN Products_2NF ON Transactions_1NF.Barcode = Products_2NF.Barcode ;

Query started at 07:25:54 PM South Africa Standard Time; Query executed in 0.00 m

<a id='Target_ERD'></a>
### 8. Convert the table into its 3rd Normal Form (3NF)

Please label your tables as they appear in the ERD sketch. In the same fashion as done in 2NF, note which tables need to have data inserted `where column <> '' and column is not null`.

<br>

![3rd Normal Form](https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/3rdNF.png)

In [135]:
%%read_sql

--#Create tables required for 2NF
DROP TABLE IF EXISTS "Transactions_3NF";
DROP TABLE IF EXISTS "Carts_3NF";
DROP TABLE IF EXISTS "Products_3NF";
DROP TABLE IF EXISTS "Users_3NF";
DROP TABLE IF EXISTS "Navigation_3NF";
DROP TABLE IF EXISTS "PackageContents_3NF";
DROP TABLE IF EXISTS "Colours_3NF";
DROP TABLE IF EXISTS "Brands_3NF";
DROP TABLE IF EXISTS "Locations_3NF";

CREATE TABLE "Products_3NF" (
    "RegistryID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "ProductDescription" VARCHAR(150) NOT NULL,
    "Price" REAL NOT NULL,
    "Quantity" INTEGER NOT NULL,
    "Weight_kg" REAL,
    "Volume_litre" REAL,
    "Length" REAL,
    "Width" REAL,
    "Height" REAL,
    "PathID" INTEGER,
    "ItemID" INTEGER,
    "ColourID" INTEGER,
    "BrandID" INTEGER,
    "LocationID" INTEGER,
    PRIMARY KEY("RegistryID" AUTOINCREMENT),
    FOREIGN KEY("PathID") REFERENCES "Navigation_3NF" ("PathID"),
    FOREIGN KEY("ItemID") REFERENCES "PackageContents_3NF" ("ItemID"),
    FOREIGN KEY("ColourID") REFERENCES "Colours_3NF" ("ColourID") ,
    FOREIGN KEY ("BrandID") REFERENCES "Brands_3NF" ("BrandID"),
    FOREIGN KEY ("LocationID") REFERENCES "Locations_3NF" ("LocationID")
);


CREATE TABLE "Carts_3NF" (
    "CartID" INTEGER NOT NULL,
    "InvoiceDate" DATETIME NOT NULL,
    "Total" REAL NOT NULL,
    PRIMARY KEY ("CartID")
);


CREATE TABLE "Users_3NF"(
    "UserID" INTEGER NOT NULL,
    UserName VARCHAR(50) NOT NULL,
    PRIMARY KEY("UserID" AUTOINCREMENT)
);

Query started at 07:25:54 PM South Africa Standard Time; Query executed in 0.00 m

### <font color='turquoise'>Action: proceed with the construction of the remaining tables mentioned </font>

In [136]:
%%read_sql

CREATE TABLE "Transactions_3NF" ('CartID||Barcode||Username' VARCHAR(150),
                                 'CartID' INTEGER NOT NULL,
                                 'Barcode' VARCHAR(150) NOT NULL,
                                 'UserID' INTETER NOT NULL,
                                 PRIMARY KEY ('CartID||Barcode||Username'),
                                 FOREIGN KEY ('CartID') REFERENCES 'Carts_3NF' ('CartID'),
                                 FOREIGN KEY ('Barcode')REFERENCES 'Products_3NF' ('UserID'),
                                 FOREIGN KEY ('UserID') REFERENCES 'Users_3NF' ('UserID')
                                );
    
    
CREATE TABLE "Navigation_3NF" ('PathID' INTEGER NOT NULL,
                                'NavigationPath' VARCHAR(150),
                                PRIMARY KEY ('PathID' AUTOINCREMENT)
                              );


CREATE TABLE "PackageContents_3NF" ('ItemID' INTEGER NOT NULL,
                                    'ItemDescription' VARCHAR(150),
                                    'PackType' VARCHAR(150),
                                    'Warranty' VARCHAR(150),
                                    PRIMARY KEY ('ItemID' AUTOINCREMENT)
                                   );


CREATE TABLE "Colours_3NF" ('ColourID' INTEGER NOT NULL,
                            'Colour' VARCHAR(150),
                            PRIMARY KEY ('ColourID' AUTOINCREMENT)
                           );


CREATE TABLE "Brands_3NF" ('BrandID' INTEGER NOT NULL,
                           'Brand' VARCHAR(150),
                           PRIMARY KEY ('BrandID' AUTOINCREMENT)
                          );

    
CREATE TABLE "Locations_3NF" ('LocationID' INTEGER NOT NULL,
                              'StockCountry' VARCHAR(150),
                              PRIMARY KEY ('LocationID' AUTOINCREMENT)
                             );

Query started at 07:25:54 PM South Africa Standard Time; Query executed in 0.00 m

In [137]:
%%read_sql

--# Populate the tables to that they conform to the 3rd Normal Form
DELETE FROM "Products_3NF";
DELETE FROM "Transactions_3NF";
DELETE FROM "Carts_3NF";
DELETE FROM "Users_3NF";
DELETE FROM "Navigation_3NF";
DELETE FROM "PackageContents_3NF";
DELETE FROM "Colours_3NF";
DELETE FROM "Brands_3NF";
DELETE FROM "Locations_3NF";

INSERT INTO "Users_3NF" ("UserName")
SELECT DISTINCT UserName FROM Transactions_2NF;

Query started at 07:25:54 PM South Africa Standard Time; Query executed in 0.00 m

### <font color='turquoise'>Action: proceed with the insertion into `Carts_3NF`.   </font>

Take note that there are duplicate values coming from `Transactions_2NF` - retain the `distinct` combinations of `CartID`,`InvoiceDate`,`Total` only.

In [138]:
%%read_sql

INSERT INTO "Carts_3NF"("CartID","InvoiceDate","Total")
SELECT DISTINCT CartID, InvoiceDate, Total
FROM Transactions_2NF;

Query started at 07:25:55 PM South Africa Standard Time; Query executed in 0.00 m

### <font color='turquoise'>Action: proceed with the insertion into the tables below. </font>

Similarly to the table above, mind the occurances of duplicate entries. These can be avoided by using `SELECT distinct` to avoid inserting redundant rows.

In [139]:
%%read_sql

INSERT INTO "Locations_3NF" ("StockCountry")
SELECT DISTINCT StockCountry
FROM Products_2NF
WHERE StockCountry <> '';

INSERT INTO "Brands_3NF" ("Brand")
SELECT DISTINCT Brand
FROM Products_2NF
WHERE Brand <> '';

INSERT INTO "Colours_3NF" ("Colour")
SELECT DISTINCT Colour
FROM Colours_2NF
WHERE Colour <> '';

INSERT INTO "PackageContents_3NF" ("ItemDescription","PackType","Warranty")
SELECT DISTINCT ItemDescription, PackType, Warranty
FROM PackageContents_2NF
WHERE ItemDescription <> '';

INSERT INTO "Navigation_3NF" ("NavigationPath")
SELECT DISTINCT NavigationPath
FROM Navigation_2NF;

Query started at 07:25:55 PM South Africa Standard Time; Query executed in 0.00 m

### <font color='turquoise'>Action: proceed with the insertion into `Products_3NF`. </font>
Take note of the joins required for additional data contained in other tables.

In [140]:
%%read_sql

INSERT INTO "Products_3NF" ("PathID","ItemID","ColourID","BrandID","LocationID",
                            "Barcode","ProductDescription","Price",
                            "Quantity","Weight_kg","Volume_litre",
                            "Length","Width","Height")
SELECT
    Navigation_3NF.PathID,
    PackageContents_3NF.ItemID,
    Colours_3NF.ColourID,
    Brands_3NF.BrandID,
    Locations_3NF.LocationID,
    Products_2NF.Barcode,
    ProductDescription,
    Price,
    Quantity,
    Weight_kg,
    Volume_litre,
    Length,
    Width,
    Height
    
FROM
    Products_2NF
LEFT JOIN Navigation_3NF ON Products_2NF.PathID = Navigation_3NF.NavigationPath
LEFT JOIN Colours_3NF ON Products_2NF.ColourID = Colours_3NF.Colour
LEFT JOIN PackageContents_3NF ON Products_2NF.ItemID = PackageContents_3NF.ItemDescription
LEFT JOIN Brands_3NF ON Products_2NF.Brand = Brands_3NF.Brand
LEFT JOIN Locations_3NF ON Products_2NF.StockCountry = Locations_3NF.StockCountry

Query started at 07:25:55 PM South Africa Standard Time; Query executed in 0.00 m

### <font color='turquoise'>Action: proceed with the insertion into `Transactions_3NF`.   </font>

Follow previous proceedure, and checks.

In [141]:
%%read_sql

INSERT INTO "Transactions_3NF" ("CartID||Barcode||UserName","CartID","Barcode","UserID")
SELECT DISTINCT
    Transactions_2NF.CartID||Transactions_2NF.Barcode||Users_3NF.Username,
    Transactions_2NF.CartID,
    Transactions_2NF.Barcode,
    Users_3NF.UserID
FROM
    Transactions_2NF
LEFT JOIN Products_3NF ON Transactions_2NF.Barcode = Products_3NF.Barcode
LEFT JOIN Users_3NF ON Users_3NF.UserName = Transactions_2NF.UserName
LEFT JOIN Carts_3NF ON Transactions_2NF.InvoiceDate = Carts_3NF.InvoiceDate

Query started at 07:25:55 PM South Africa Standard Time; Query executed in 0.00 m

### <font color='turquoise'>Action: Investigate the DB.   </font>

Note - the tables counts below are what you should arrive at. If you don't, reconsider how you have done the inserts above. Having the tables correctly formatted will allow to answer the questions more easily, and without errors.

In [142]:
%%read_sql 

-- How many entries are here in each of the tables in the database now? 
select '3. Products_3NF' as table_name, count(*) from Products_3NF
UNION
select '3. Transactions_3NF' as table_name, count(*) from Transactions_3NF
UNION
select '3. Users_3NF' as table_name, count(*) from Users_3NF
UNION
select '3. Navigation_3NF' as table_name, count(*) from Navigation_3NF
UNION
select '3. PackageContents_3NF' as table_name, count(*) from PackageContents_3NF
UNION
select '3. Colours_3NF' as table_name, count(*) from Colours_3NF
UNION
select '3. Brands_3NF' as table_name, count(*) from Brands_3NF
UNION
select '3. Locations_3NF' as table_name, count(*) from Locations_3NF
UNION
select '3. Carts_3NF' as table_name, count(*) from Carts_3NF

Query started at 07:25:55 PM South Africa Standard Time; Query executed in 0.00 m

               table_name  count(*)
0           3. Brands_3NF       232
1            3. Carts_3NF       190
2          3. Colours_3NF        17
3        3. Locations_3NF         2
4       3. Navigation_3NF       396
5  3. PackageContents_3NF       600
6         3. Products_3NF      1214
7     3. Transactions_3NF       275
8            3. Users_3NF       158

<a id='MCQ_questions'></a>
## 9. MCQ Questions

Having completed the normalisation of the database, you may use the following cells to help you answer the MCQs for the predict.

Q1) How many unique products does the company have?

In [143]:
%%read_sql
-- Write your query here:

SELECT COUNT (DISTINCT Barcode)
FROM Products_3NF;

Query started at 07:25:55 PM South Africa Standard Time; Query executed in 0.00 m

   COUNT (DISTINCT Barcode)
0                       608

Q2) How many users bought from Bhejane in April 2020?

In [155]:
%%read_sql
-- Write your query here:
    
SELECT COUNT (DISTINCT UserName)
FROM Transactions
WHERE InvoiceDate BETWEEN '2020-04-01' AND '2020-05-01';

Query started at 07:40:39 PM South Africa Standard Time; Query executed in 0.00 m

   COUNT (DISTINCT UserName)
0                         31

Q3) How many users bought 3 or more items that cost more than R1000?

In [157]:
%%read_sql
-- Write your query here:

SELECT COUNT(*)
FROM Carts_3NF AS c
JOIN Transactions_3NF AS t
WHERE c.CartID = t.CartID
AND Total > 1000.00
GROUP BY c.CartID
HAVING COUNT(c.CartID) >= 3;

Query started at 07:42:33 PM South Africa Standard Time; Query executed in 0.00 m

    COUNT(*)
0          3
1          4
2          3
3          3
4          4
5          4
6          3
7          3
8          4
9          4
10         3

Q4) Which user made the largest purchase on a single transaction?

In [107]:
%%read_sql
-- Write your query here:

SELECT *
FROM Transactions
ORDER BY Total DESC;

Query started at 07:17:47 PM South Africa Standard Time; Query executed in 0.00 m

     CartID        Barcode    Total       UserName         InvoiceDate
0       123    HTB5ABG31E3  10999.0         Mandla  2020-04-11 0:00:00
1       124    HTB5ABG31E3  10999.0       Brigette  2020-05-30 0:00:00
2       125    HTB5FI3BC8C   3765.0  Andreas Peter  2020-03-27 0:00:00
3       126    HTB5FI3BC8C   3765.0        Mzoxolo  2020-08-12 0:00:00
4       179   617566827837   3464.0         Zanele  2020-04-04 0:00:00
..      ...            ...      ...            ...                 ...
273      39  6001865825405     23.0          Wayne  2020-08-10 0:00:00
274      44  6002292008348     13.0         Janine  2020-05-08 0:00:00
275      60  6006485007460     12.0          Cindy  2020-07-01 0:00:00
276      93  8714574600109     10.0       Michelle  2020-05-17 0:00:00
277      37  6001651090130      1.0         Ridhaa  2020-04-21 0:00:00

[278 rows x 5 columns]

Q5) How many components does the product: "5m Colour Changing RGB LED Strip Light" (MPTAL57588104) come with?

In [108]:
%%read_sql
-- Write your query here:

SELECT DISTINCT *
FROM Products
WHERE ProductDescription = '5m Colour Changing RGB LED Strip Light'
GROUP BY ItemDescription;

Query started at 07:17:50 PM South Africa Standard Time; Query executed in 0.00 m

,Width,Length,Height,Barcode,Quantity,Brand,NavigationPath,Colour,StockCountry,ProductDescription,PackType,Volume_litre,Warranty,Weight_kg,ItemDescription,Price
0,"0,5",5000.0,"0,01",MPTAL57588104,220.0,,"Garden, Pool & Patio / Home Improvement / Ligh...",Assorted,,5m Colour Changing RGB LED Strip Light,,0.0,Limited (12 months),,1 x 12V 3A Power Supply,370.0
1,"0,5",5000.0,"0,01",MPTAL57588104,220.0,,"Garden, Pool & Patio / Home Improvement / Ligh...",Assorted,,5m Colour Changing RGB LED Strip Light,,0.0,Limited (12 months),,1 x 24 key IR remote controller,370.0
2,"0,5",5000.0,"0,01",MPTAL57588104,220.0,,"Garden, Pool & Patio / Home Improvement / Ligh...",Assorted,,5m Colour Changing RGB LED Strip Light,,0.0,Limited (12 months),,1 x 5 Meter LED RGB Strip Light,370.0
3,"0,5",5000.0,"0,01",MPTAL57588104,220.0,,"Garden, Pool & Patio / Home Improvement / Ligh...",Assorted,,5m Colour Changing RGB LED Strip Light,,0.0,Limited (12 months),,1 x IR Controller,370.0

Q6) How many brands are available at Bhejane?

In [109]:
%%read_sql
-- Write your query here:
SELECT COUNT(*)
FROM Brands_3NF;

Query started at 07:21:19 PM South Africa Standard Time; Query executed in 0.00 m

   COUNT(*)
0       232

7) What is the price of the "Verimark - Floorwiz 2in1 Mop"?

In [158]:
%%read_sql
-- Write your query here:

SELECT *
FROM Products_3NF
WHERE ProductDescription = 'Verimark - Floorwiz 2in1 Mop'
GROUP BY Price;

Query started at 07:43:42 PM South Africa Standard Time; Query executed in 0.00 m

,RegistryID,Barcode,ProductDescription,Price,Quantity,Weight_kg,Volume_litre,Length,Width,Height,PathID,ItemID,ColourID,BrandID,LocationID
0,537,6005427110503,Verimark - Floorwiz 2in1 Mop,179.0,104,,0.0,90.0,14.0,2.0,None,None,None,None,1

Q8) Calculate the package volume of the "Russell Hobbs - Slow Cooker" using the given dimensions

In [162]:
%%read_sql
-- Write your query here:

-- Assumming we had to calculate dimentions manually

SELECT Width*Length*Height AS PackageVolume
FROM Products
WHERE ProductDescription = 'Russell Hobbs - Slow Cooker'
GROUP BY PackageVolume;

Query started at 07:45:51 PM South Africa Standard Time; Query executed in 0.00 m

   PackageVolume
0        26928.0

Q9) Which user made the most transactions in the Year 2020?

In [167]:
%%read_sql
-- Write your query here:

SELECT COUNT(CartID) CartID, Barcode, Total, UserName, InvoiceDate
FROM Transactions
GROUP BY UserName
ORDER BY CartID DESC
LIMIT 1;

Query started at 07:49:21 PM South Africa Standard Time; Query executed in 0.00 m

   CartID        Barcode  Total  UserName         InvoiceDate
0       9  4015400541813  459.0  Cornelis  2020-05-19 0:00:00

Q10) What is the total number of users that shop at Bhejane?

In [112]:
%%read_sql
-- Write your query here:

SELECT COUNT(*)
FROM Users_3NF;

Query started at 07:21:51 PM South Africa Standard Time; Query executed in 0.00 m

   COUNT(*)
0       158

Q11) What is the record count for the Colours_3NF Table?

In [113]:
%%read_sql
-- Write your query here:

SELECT COUNT(*)
FROM Colours_3NF;

Query started at 07:21:53 PM South Africa Standard Time; Query executed in 0.00 m

   COUNT(*)
0        17

Q12) What would the total price be if I had the following items in my cart?
* MPTAL57588104
* 5000394203921
* 6932391917652

In [172]:
%%read_sql
-- Write your query here:

SELECT SUM(DISTINCT Price) AS Total
FROM Products_3NF
WHERE Barcode = 'MPTAL57588104'
OR Barcode = '5000394203921'
OR Barcode = '6932391917652';

Query started at 07:51:28 PM South Africa Standard Time; Query executed in 0.00 m

   Total
0  734.0

Q13) What is the barcode of the most sold product?

In [212]:
%%read_sql
-- Write your query here:

SELECT COUNT(Total), Barcode
FROM Transactions
GROUP BY Barcode
ORDER BY COUNT(Barcode) DESC
LIMIT 1;

Query started at 08:25:35 PM South Africa Standard Time; Query executed in 0.00 m

   COUNT(Total)        Barcode
0             4  4015400541813

Q14) What are the products of Cornelisâ cart on the 2020-06-28 0:00:00?

In [240]:
%%read_sql
-- Write your query here:

SELECT DISTINCT *
FROM Transactions AS t
JOIN Products AS p
ON p.Barcode = t.Barcode
WHERE Username = 'Cornelis'
AND InvoiceDate = '2020-06-28 0:00:00'
GROUP BY ProductDescription;

Query started at 08:41:51 PM South Africa Standard Time; Query executed in 0.00 m

,CartID,Barcode,Total,UserName,InvoiceDate,Width,Length,Height,Barcode,Quantity,...,NavigationPath,Colour,StockCountry,ProductDescription,PackType,Volume_litre,Warranty,Weight_kg,ItemDescription,Price
0,104,6001106124069,346.0,Cornelis,2020-06-28 0:00:00,,,,6001106124069,52.0,...,Health / Personal Care / Lip & Skin Care / Bod...,,South Africa,Dettol Body Wash - Shower Gel - Original - 600ml,,0.0,Limited (6 months),,1 X Dettol Original 600ml Shower Gel,50.0
1,104,MPTAL72193414,346.0,Cornelis,2020-06-28 0:00:00,,,,MPTAL72193414,261.0,...,Health / Health Care / First Aid / First Aid S...,,,Protective Face Shield,,0.0,Limited (6 months),,1x Headband,41.0
2,104,MPTAL00555756,346.0,Cornelis,2020-06-28 0:00:00,,,,MPTAL00555756,194.0,...,Sport / Fitness / Fitness Accessories / Other ...,Assorted,,Sparq Active Resistance Loop Band - Set of 5 w...,,0.0,Limited (6 months),,1 x carry case,199.0
3,104,6003753002035AP,346.0,Cornelis,2020-06-28 0:00:00,,,,6003753002035AP,207.0,...,Beauty / Body Care / Moisturisers & Creams,,South Africa,Vitality Aloe Vera Gel 100ml,,0.0,Limited (6 months),,,56.0

Q15) Which users bought locally produced, black-coloured products on odd-numbered months of the year, and what was the total cost (rounded to the nearest integer) of the carts containing these products?

In [239]:
%%read_sql
-- Write your query here:

SELECT Total, UserName, Colour, StockCountry, InvoiceDate
FROM Transactions_2NF AS t
JOIN Products_2NF AS p
ON p.Barcode = t.Barcode
JOIN Colours_2NF AS c
ON c.ColourID = p.ColourID
WHERE StockCountry = 'South Africa'
AND c.Colour = 'Black'
GROUP BY UserName
ORDER BY InvoiceDate;

Query started at 08:41:04 PM South Africa Standard Time; Query executed in 0.00 m

     Total       UserName Colour  StockCountry         InvoiceDate
0   1999.0          Cindy  Black  South Africa  2020-03-31 0:00:00
1    775.0           Erlo  Black  South Africa  2020-04-10 0:00:00
2    149.0       Charlene  Black  South Africa  2020-04-16 0:00:00
3    745.0          keith  Black  South Africa  2020-04-24 0:00:00
4    799.0          Carel  Black  South Africa  2020-05-04 0:00:00
5    798.0          Lacin  Black  South Africa  2020-05-18 0:00:00
6    840.0         Zanele  Black  South Africa  2020-06-01 0:00:00
7   1334.0          Hanno  Black  South Africa  2020-06-09 0:00:00
8    798.0  Kelsey Brynne  Black  South Africa  2020-06-16 0:00:00
9    899.0        Waylenn  Black  South Africa  2020-06-19 0:00:00
10  1523.0         DIMPHO  Black  South Africa  2020-07-02 0:00:00
11   189.0         Hester  Black  South Africa  2020-07-04 0:00:00
12    93.0         Conrad  Black  South Africa  2020-07-26 0:00:00
13   179.0        Jeandre  Black  South Africa  2020-07-28 0:00:00